monte-monte/stm8flash_retriever/main.c
		}
		if(pgm_serialno_specified && i==cnt) {
			fprintf(stderr, "ERROR: No programmer with serial number %s found.\n", pgm_serialno);
			return(false);
		}
	}
	else
	{
		pgm->dev_handle = libusb_open_device_with_vid_pid(ctx, pgm->usb_vid, pgm->usb_pid);
	}




	pgm->ctx = ctx;
	if (!pgm->dev_handle) spawn_error("Could not open USB device.");
	// assert(pgm->dev_handle);

	libusb_free_device_list(devs, 1); //free the list, unref the devices in it

	if(libusb_kernel_driver_active(pgm->dev_handle, 0) == 1) { //find out if kernel driver is attached
		int r = libusb_detach_kernel_driver(pgm->dev_handle, 0);
		assert(r == 0);
	}

	r = libusb_claim_interface(pgm->dev_handle, 0);
	assert(r == 0);

	return(true);
}

static bool is_interesting_usb(const uint16_t vid, const uint16_t pid) {
	for (int i = 0; i < (sizeof(pgms) / sizeof(pgms[0])); i++) {
		if ((pgms[i].usb_pid == pid) && (pgms[i].usb_vid == vid)) {
			return true;
		}
	}
	return false;
}

void dump_stlink_programmers(void) {
	libusb_device **devs;
	libusb_context *ctx = NULL;
	char vendor[32];
	char device[32];
	char serialno[32];
	char serialno_hex[64];

	int r;
	r = libusb_init(&ctx);
	if(r < 0) return;

	{
	const int usb_debug_level = 0;
#if defined(LIBUSB_API_VERSION) && (LIBUSB_API_VERSION >= 0x01000106)
		libusb_set_option(ctx, LIBUSB_OPTION_LOG_LEVEL, usb_debug_level);
#else
		libusb_set_debug(ctx, usb_debug_level);
#endif
	}

	const int cnt = libusb_get_device_list(ctx, &devs);
	if(cnt < 0) return;

	int numOfProgrammers = 0;
	// count available programmers
	for (int i = 0; i < cnt; i++) {
		struct libusb_device_descriptor desc;
		libusb_device_handle *tempHandle;
		libusb_get_device_descriptor(devs[i], &desc);

		if (is_interesting_usb(desc.idVendor, desc.idProduct)) {
			libusb_open(devs[i], &tempHandle);

			libusb_get_string_descriptor_ascii(tempHandle, desc.iManufacturer, (unsigned char*)vendor, sizeof(vendor));
			libusb_get_string_descriptor_ascii(tempHandle, desc.iProduct, (unsigned char*)device, sizeof(device));
			const int serialno_length = libusb_get_string_descriptor_ascii(tempHandle, desc.iSerialNumber, (unsigned char*)serialno, sizeof(serialno));
			serialno_to_hex(serialno, serialno_length, serialno_hex);

			// print programmer data if no serial number specified
			fprintf(stdout, "Programmer %d: %s %s, Serial Number:%.*s\n", numOfProgrammers, vendor, device, 2*serialno_length, serialno_hex);
			libusb_close(tempHandle);
			numOfProgrammers++;
		}
	}
	
	libusb_free_device_list(devs, 1);
}

const stm8_device_t *get_part(const char *name)
{
	for(unsigned int i = 0; stm8_devices[i].name; i++)
	{
		const char *e = stm8_devices[i].name;
		const char *s = name;
		for(e = stm8_devices[i].name, s = name; *s && (*e == *s || toupper(*e) == *s || *e == '?'); e++, s++);
		if(!*e)
			return(&stm8_devices[i]);
	}
	return(0);
}

int main(int argc, char **argv) {
	unsigned int start;
	int bytes_count = 0;
	char filename[256];
	memset(filename, 0, sizeof(filename));
	bool need_file = true;
	char pgm_serialno[64];
	memset(pgm_serialno, 0, sizeof(pgm_serialno));
	// Parsing command line
	char c;
	action_t action = NONE;
	fileformat_t fileformat = RAW_BINARY;
	bool start_addr_specified = false,
		pgm_specified = false,
		pgm_serialno_specified = false,
		part_specified = false,
		bytes_count_specified = false;
	memtype_t memtype = FLASH;
	const char * port = NULL;
	int i;
	programmer_t *pgm = NULL;
	const stm8_device_t *part = NULL;

	setbuf (stderr, 0); // Make stderr unbuffered (which is the default on POSIX anyway, but not on Windows).
	setbuf (stdout, 0); // Also make stdout unbuffered (performance doesn't matter much here, bug quick progress display is useful).

	while((c = getopt(argc, argv, "a:r:w:v:nc:S:p:d:s:b:hluVLRo")) != (char)-1) {
    // printf("%c\n", c);
		switch(c) {
			case 'c':
				pgm_specified = true;
				for(i = 0; pgms[i].name; i++) {
					if(!strcmp(optarg, pgms[i].name))
						pgm = &pgms[i];
				}
				break;
			case 'S':
				pgm_serialno_specified = true;
				if(NULL != optarg)
					strncpy(pgm_serialno, optarg, sizeof(pgm_serialno));
				break;
			case 'p':
				part_specified = true;
				part = get_part(optarg);
				break;
			case 'd':
				port = strdup(optarg);
				break;
			case 'L':
				dump_stlink_programmers();
				exit(0);
			case 'l':
				for(i = 0; stm8_devices[i].name; i++)
					printf("%s ", stm8_devices[i].name);
				printf("\n");
				exit(0);
      case 'o':
        action = ROP;
        need_file = false;
        break;
			case 'a':
				action = READALL;
				strcpy(filename, optarg);
				break;
			case 'r':
				action = READ;
				strcpy(filename, optarg);
				break;
			case 'w':
				action = WRITE;
				strcpy(filename, optarg);
				break;
			case 'v':
				action = VERIFY;
				strcpy(filename, optarg);
				break;
			case 'u':
				action = UNLOCK;
				start  = 0x4800;
				memtype = OPT;
				strcpy(filename, "Workaround");
				break;
			case 's':
				// Start addr is depending on MCU type
				if(strcasecmp(optarg, "flash") == 0) {
					memtype = FLASH;
				} else if(strcasecmp(optarg, "eeprom") == 0) {
					memtype = EEPROM;
				} else if(strcasecmp(optarg, "ram") == 0) {
					memtype = RAM;
				} else if(strcasecmp(optarg, "opt") == 0) {
					memtype = OPT;
				} else {
					// Start addr is specified explicitely
					memtype = UNKNOWN;
					if(sscanf(optarg, "%x", (unsigned*)&start) != 1)
						spawn_error("Invalid memory type or location specified");
					start_addr_specified = true;
				}
				break;
			case 'b':
				bytes_count = atoi(optarg);
				bytes_count_specified = true;
				break;
			case 'V':
				print_version_and_exit( (bool)0);
				break;
			case 'R':
				action = RESET;
				need_file = false;
				break;
			case 'h':
				print_help_and_exit(argv[0], false);
			default:
				print_help_and_exit(argv[0], true);
		}
	}
	if (optind < argc) {
		// some additional unsupported arguments were given on the command line
		print_help_and_exit(argv[0], true);
	}
	if(argc <= 1)
		print_help_and_exit(argv[0], true);
	if(pgm_specified && !pgm) {
		fprintf(stderr, "No valid programmer specified. Possible values are:\n");
		dump_pgms( (programmer_t *) &pgms);
		exit(-1);
	}
	if(!pgm)
		spawn_error("No programmer has been specified");
	pgm->port = port;
	if(part_specified && !part) {
		fprintf(stderr, "No valid part specified. Use -l to see the list of supported devices.\n");
		exit(-1);
	}
	if(!part)
		spawn_error("No part has been specified");

  if (action == ROP) {
    size_t opt_size = (part->flash_size <= 8*1024 ? 0x40 : 0x80);
    start = 0x4800;
		start_addr_specified = true;
    bytes_count = opt_size;
    fileformat = INTEL_HEX;
    extern int rop_byte;

    if(!usb_init(pgm, pgm_serialno_specified, pgm_serialno))
		spawn_error("Couldn't initialize stlink");

