monte-monte/stm8flash_retriever/main.c
    bool open = stlink2_open(pgm);

		fprintf(stderr, "ROP: %02x\n", rop_byte);

    exit(open);
  }

	// Try define memory type by address
	if(memtype == UNKNOWN) {
		if((start >= 0x4800) && (start < 0x4880)) {
			memtype = OPT;
		}
		if((start >= part->ram_start) && (start < part->ram_start + part->ram_size)) {
			memtype = RAM;
		}
		else if((start >= part->flash_start) && (start < part->flash_start + part->flash_size)) {
			memtype = FLASH;
		}
		else if((start >= part->eeprom_start) && (start < part->eeprom_start + part->eeprom_size)) {
			memtype = EEPROM;
		}
	}
  

	switch (memtype) {
	case RAM:
		if(!start_addr_specified) {
			start = part->ram_start;
			start_addr_specified = true;
		}
		if(!bytes_count_specified || bytes_count > part->ram_size) {
			bytes_count = part->ram_size;
		}
		fprintf(stderr, "Determine RAM area\r\n");
		break;
	case EEPROM:
		if(!start_addr_specified) {
			start = part->eeprom_start;
			start_addr_specified = true;
		}
		if(!bytes_count_specified || bytes_count > part->eeprom_size) {
			bytes_count = part->eeprom_size;
		}
		fprintf(stderr, "Determine EEPROM area\r\n");
		break;
	case FLASH:
		if(!start_addr_specified) {
			start = part->flash_start;
			start_addr_specified = true;
		}
		if(!bytes_count_specified || bytes_count > part->flash_size) {
			bytes_count = part->flash_size;
		}
		fprintf(stderr, "Determine FLASH area\r\n");
		break;
	case OPT:
		if(!start_addr_specified) {
			start = 0x4800;
			start_addr_specified = true;
		}
		size_t opt_size = (part->flash_size <= 8*1024 ? 0x40 : 0x80);
		if(!bytes_count_specified || bytes_count > opt_size) {
			bytes_count = opt_size;
		}
		fprintf(stderr, "Determine OPT area\r\n");
		break;
	case UNKNOWN:
		;
	}

	if(!action)
		spawn_error("No action has been specified");
	if(!start_addr_specified)
		spawn_error("No memtype or start_addr has been specified");
	if (need_file && !strlen(filename))
		spawn_error("No filename has been specified");
	if(!action || !start_addr_specified || (need_file && !strlen(filename)))
		print_help_and_exit(argv[0], true);
	if(!usb_init(pgm, pgm_serialno_specified, pgm_serialno))
		spawn_error("Couldn't initialize stlink");
	if(!pgm->open(pgm))
		spawn_error("Error communicating with MCU. Please check your SWIM connection.");

	if(is_ext(filename, ".ihx") || is_ext(filename, ".hex") || is_ext(filename, ".i86"))
		fileformat = INTEL_HEX;
	else if(is_ext(filename, ".s19") || is_ext(filename, ".s8") || is_ext(filename, ".srec"))
		fileformat = MOTOROLA_S_RECORD;
	fprintf(stderr, "Due to its file extension (or lack thereof), \"%s\" is considered as %s format!\n", filename, fileformat == INTEL_HEX ? "INTEL HEX" : (fileformat == MOTOROLA_S_RECORD ? "MOTOROLA S-RECORD" : "RAW BINARY"));

	FILE *f;
	if(action == READ) {
		fprintf(stderr, "Reading %d bytes at 0x%x... ", bytes_count, start);
		int bytes_count_align = ((bytes_count-1)/256+1)*256; // Reading should be done in blocks of 256 bytes
		unsigned char *buf = malloc(bytes_count_align);
		if(!buf) spawn_error("malloc failed");
    int recv = pgm->read_range(pgm, part, buf, part->flash_start, 256);
		if(recv < 256) {
			fprintf(stderr, "\r\nRequested 256 bytes but received only %d.\r\n", recv);
			spawn_error("Failed to read MCU");
		}
    if (buf[0] == 0) {
      fprintf(stderr, "\r\nRead is locked.\r\n");
      exit(100);
    } else {
      fprintf(stderr, "\r\nRead: %u\r\n", buf[0]);
    }
		recv = pgm->read_range(pgm, part, buf, start, bytes_count_align);
		if(recv < bytes_count_align) {
			fprintf(stderr, "\r\nRequested %d bytes but received only %d.\r\n", bytes_count_align, recv);
			spawn_error("Failed to read MCU");
		}
		if(!(f = fopen(filename, (fileformat == RAW_BINARY) ? "wb" : "w")))
			spawn_error("Failed to open file");
		switch(fileformat)
		{
		case INTEL_HEX:
			if(ihex_write(f, buf, start, start+bytes_count) < 0)
			  exit(-1);
			break;
		case MOTOROLA_S_RECORD:
			srec_write(f, buf, start, start+bytes_count);
			break;
		default:
			fwrite(buf, 1, bytes_count, f);
		}
		fclose(f);
		fprintf(stderr, "OK\n");
		fprintf(stderr, "Bytes received: %d\n", bytes_count);
  } else if (action == READALL) {
    // if(!start_addr_specified) {
		// 	start = part->flash_start;
		// 	start_addr_specified = true;
		// }
		// if(!bytes_count_specified || bytes_count > part->flash_size) {
		// 	bytes_count = part->flash_size;
		// }
    bytes_count = part->flash_size;
    start = part->flash_start;
    char new_filename[264];
    memset(new_filename, 0, sizeof(new_filename));
    int bytes_count_align = ((bytes_count-1)/256+1)*256; // Reading should be done in blocks of 256 bytes
    unsigned char *buf = malloc(bytes_count_align);
    if(!buf) spawn_error("malloc failed");
    int recv = pgm->read_range(pgm, part, buf, 0x4800, 128);
    if(recv < 128) {
      fprintf(stderr, "\r\nRequested 256 bytes but received only %d.\r\n", recv);
      spawn_error("Failed to read MCU");
    }
    for (int i = 1; i <= 16; i++) {
      // fprintf(stderr, "%u ", buf[i]);
      if (buf[0] != buf[i]) {
        break;
      }
      if (i == 16) {
        fprintf(stderr, "\r\nRead is locked.\r\n");
        exit(100);
      }
    }
    // if (buf[0] == 0) {
      
    // } else {
      fprintf(stderr, "\r\nRead: %u\r\n", buf[0]);
    // }
    // Reading flash
    fprintf(stderr, "Reading %d bytes at 0x%x... ", bytes_count, start);
    recv = pgm->read_range(pgm, part, buf, start, bytes_count_align);
    if(recv < bytes_count_align) {
      fprintf(stderr, "\r\nRequested %d bytes but received only %d.\r\n", bytes_count_align, recv);
      spawn_error("Failed to read MCU");
    }
    strcpy(new_filename, filename);
    strcat(new_filename, "_flash");
    // fprintf(stderr, "\r\nOpening file: %s.\r\n", new_filename);
    if(!(f = fopen(new_filename, (fileformat == RAW_BINARY) ? "wb" : "w")))
      spawn_error("Failed to open file");
    switch(fileformat)
    {
    case INTEL_HEX:
      if(ihex_write(f, buf, start, start+bytes_count) < 0)
        exit(-1);
      break;
    case MOTOROLA_S_RECORD:
      srec_write(f, buf, start, start+bytes_count);
      break;
    default:
      fwrite(buf, 1, bytes_count, f);
    }
    fclose(f);
    fprintf(stderr, "OK\n");
    fprintf(stderr, "Bytes received: %d\n", bytes_count);
    // Reading EEPROM
    bytes_count = part->eeprom_size;
    start = part->eeprom_start;
    fprintf(stderr, "Reading %d bytes at 0x%x... ", bytes_count, start);
    recv = pgm->read_range(pgm, part, buf, start, bytes_count_align);
    if(recv < bytes_count_align) {
      fprintf(stderr, "\r\nRequested %d bytes but received only %d.\r\n", bytes_count_align, recv);
      spawn_error("Failed to read MCU");
    }
    strcpy(new_filename, filename);
    strcat(new_filename, "_eeprom");
    if(!(f = fopen(new_filename, (fileformat == RAW_BINARY) ? "wb" : "w")))
      spawn_error("Failed to open file");
    switch(fileformat)
    {
    case INTEL_HEX:
      if(ihex_write(f, buf, start, start+bytes_count) < 0)
        exit(-1);
      break;
    case MOTOROLA_S_RECORD:
      srec_write(f, buf, start, start+bytes_count);
      break;
    default:
      fwrite(buf, 1, bytes_count, f);
    }
    fclose(f);
    fprintf(stderr, "OK\n");
    fprintf(stderr, "Bytes received: %d\n", bytes_count);
    // Reading OPTBYTES
    bytes_count = (part->flash_size <= 8*1024 ? 0x40 : 0x80);
    start = 0x4800;
    fprintf(stderr, "Reading %d bytes at 0x%x... ", bytes_count, start);
    recv = pgm->read_range(pgm, part, buf, start, bytes_count_align);
    if(recv < bytes_count_align) {
      fprintf(stderr, "\r\nRequested %d bytes but received only %d.\r\n", bytes_count_align, recv);
      spawn_error("Failed to read MCU");
    }
    strcpy(new_filename, filename);
    strcat(new_filename, "_opt");
    if(!(f = fopen(new_filename, (fileformat == RAW_BINARY) ? "wb" : "w")))
      spawn_error("Failed to open file");
    switch(fileformat)
    {
    case INTEL_HEX:
      if(ihex_write(f, buf, start, start+bytes_count) < 0)
        exit(-1);
      break;
    case MOTOROLA_S_RECORD:
      srec_write(f, buf, start, start+bytes_count);
      break;
    default:
      fwrite(buf, 1, bytes_count, f);
    }
    fclose(f);
    fprintf(stderr, "OK\n");
    fprintf(stderr, "Bytes received: %d\n", bytes_count);
	} else if (action == VERIFY) {
		fprintf(stderr, "Verifing %d bytes at 0x%x... ", bytes_count, start);

